app/controllers/public/customers_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @customer = Customer.find(current_customer.id)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @customer = Customer.find(current_customer.id)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "updated_at" = ? WHERE "customers"."id" = ?  [["updated_at", "2022-06-13 16:16:02.996805"], ["id", 1]]
---
  def update
    @customer = Customer.find(current_customer.id)
    @customer.update(customer_params)