app/controllers/public/homes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def top
    @recipes = Recipe.all