app/controllers/public/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.customer = current_customer
    @recipe.save
---
INSERT INTO "recipes" ("customer_id", "title", "detail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["title", "卵焼き"], ["detail", "卵１個\r\n砂糖　適量\r\n白だし　適量"], ["created_at", "2022-06-13 16:15:32.590235"], ["updated_at", "2022-06-13 16:15:32.590235"]]

  def update
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "updated_at" = ? WHERE "recipes"."id" = ?  [["updated_at", "2022-06-14 03:18:56.211302"], ["id", 1]]